---
kind: method
id: M:Autodesk.Revit.UI.DockablePaneId.op_Inequality(Autodesk.Revit.UI.DockablePaneId,Autodesk.Revit.UI.DockablePaneId)
source: html/052c4f31-ff35-4408-2be2-ad8a95776165.htm
---
# Autodesk.Revit.UI.DockablePaneId.op_Inequality Method

Compares two DockablePaneId instances.

## Syntax (C#)
```csharp
public static bool operator !=(
	DockablePaneId first,
	DockablePaneId second
)
```

## Parameters
- **first** (`Autodesk.Revit.UI.DockablePaneId`) - The first DockablePaneId.
- **second** (`Autodesk.Revit.UI.DockablePaneId`) - The second DockablePaneId.

## Returns
True if the inputs are different, false if they are identical.